Examinator/src/Enums/ДействияПослеИстеченияВремениВыполненияОбъектаSCORM/ДействияПослеИстеченияВремениВыполненияОбъектаSCORM.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ДействияПослеИстеченияВремениВыполненияОбъектаSCORM</name>
  <comment>timeLimitAction</comment>
  <enumValues>
    <name>Выйти</name>
    <comment>exit,no message</comment>
  </enumValues>
  <enumValues>
    <name>СообщитьИВыйти</name>
    <comment>exit,message</comment>
  </enumValues>
  <enumValues>
    <name>ПродолжитьРаботу</name>
    <comment>continue,no message</comment>
  </enumValues>
  <enumValues>
    <name>СообщитьИПродолжитьРаботу</name>
    <comment>continue,message</comment>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ДействияПослеИстеченияВремениВыполненияОбъектаSCORM/ManagerModule.bsl
Функция ЗначениеSCORM(ДействиеПослеИстеченияВремени) Экспорт
	
	Если ЗначениеЗаполнено(ДействиеПослеИстеченияВремени) Тогда
		
		Если ДействиеПослеИстеченияВремени = Перечисления.ДействияПослеИстеченияВремениВыполненияОбъектаSCORM.СообщитьИВыйти Тогда
			Возврат "exit,message";
		КонецЕсли;
		
		Если ДействиеПослеИстеченияВремени = Перечисления.ДействияПослеИстеченияВремениВыполненияОбъектаSCORM.Выйти Тогда
			Возврат "exit,no message";
		КонецЕсли;
		
		Если ДействиеПослеИстеченияВремени = Перечисления.ДействияПослеИстеченияВремениВыполненияОбъектаSCORM.СообщитьИПродолжитьРаботу Тогда
			Возврат "continue,message";
		КонецЕсли;
		
		Если ДействиеПослеИстеченияВремени = Перечисления.ДействияПослеИстеченияВремениВыполненияОбъектаSCORM.ПродолжитьРаботу Тогда
			Возврат "continue,no message";
		КонецЕсли;
		
	Иначе
		
		Возврат "continue,no message";
		
	КонецЕсли;	
	
КонецФункции
